ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F1xx/stm32f107xc.h
/* Bit definition for Ethernet MAC Frame Filter Register */
#define ETH_MACFFR_RA_Pos                      (31U)                           
#define ETH_MACFFR_RA_Msk                      (0x1U << ETH_MACFFR_RA_Pos)     /*!< 0x80000000 */
#define ETH_MACFFR_RA                          ETH_MACFFR_RA_Msk               /* Receive all */ 
#define ETH_MACFFR_HPF_Pos                     (10U)                           
#define ETH_MACFFR_HPF_Msk                     (0x1U << ETH_MACFFR_HPF_Pos)    /*!< 0x00000400 */
#define ETH_MACFFR_HPF                         ETH_MACFFR_HPF_Msk              /* Hash or perfect filter */ 
#define ETH_MACFFR_SAF_Pos                     (9U)                            
#define ETH_MACFFR_SAF_Msk                     (0x1U << ETH_MACFFR_SAF_Pos)    /*!< 0x00000200 */
#define ETH_MACFFR_SAF                         ETH_MACFFR_SAF_Msk              /* Source address filter enable */ 
#define ETH_MACFFR_SAIF_Pos                    (8U)                            
#define ETH_MACFFR_SAIF_Msk                    (0x1U << ETH_MACFFR_SAIF_Pos)   /*!< 0x00000100 */
#define ETH_MACFFR_SAIF                        ETH_MACFFR_SAIF_Msk             /* SA inverse filtering */ 
#define ETH_MACFFR_PCF_Pos                     (6U)                            
#define ETH_MACFFR_PCF_Msk                     (0x3U << ETH_MACFFR_PCF_Pos)    /*!< 0x000000C0 */
#define ETH_MACFFR_PCF                         ETH_MACFFR_PCF_Msk              /* Pass control frames: 3 cases */
#define ETH_MACFFR_PCF_BlockAll_Pos            (6U)                            
#define ETH_MACFFR_PCF_BlockAll_Msk            (0x1U << ETH_MACFFR_PCF_BlockAll_Pos) /*!< 0x00000040 */
#define ETH_MACFFR_PCF_BlockAll                ETH_MACFFR_PCF_BlockAll_Msk     /* MAC filters all control frames from reaching the application */
#define ETH_MACFFR_PCF_ForwardAll_Pos          (7U)                            
#define ETH_MACFFR_PCF_ForwardAll_Msk          (0x1U << ETH_MACFFR_PCF_ForwardAll_Pos) /*!< 0x00000080 */
#define ETH_MACFFR_PCF_ForwardAll              ETH_MACFFR_PCF_ForwardAll_Msk   /* MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter_Pos (6U)                        
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter_Msk (0x3U << ETH_MACFFR_PCF_ForwardPassedAddrFilter_Pos) /*!< 0x000000C0 */
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter ETH_MACFFR_PCF_ForwardPassedAddrFilter_Msk /* MAC forwards control frames that pass the Address Filter. */ 
#define ETH_MACFFR_BFD_Pos                     (5U)                            
#define ETH_MACFFR_BFD_Msk                     (0x1U << ETH_MACFFR_BFD_Pos)    /*!< 0x00000020 */
#define ETH_MACFFR_BFD                         ETH_MACFFR_BFD_Msk              /* Broadcast frame disable */ 
#define ETH_MACFFR_PAM_Pos                     (4U)                            
#define ETH_MACFFR_PAM_Msk                     (0x1U << ETH_MACFFR_PAM_Pos)    /*!< 0x00000010 */
#define ETH_MACFFR_PAM                         ETH_MACFFR_PAM_Msk              /* Pass all mutlicast */ 
#define ETH_MACFFR_DAIF_Pos                    (3U)                            
#define ETH_MACFFR_DAIF_Msk                    (0x1U << ETH_MACFFR_DAIF_Pos)   /*!< 0x00000008 */
#define ETH_MACFFR_DAIF                        ETH_MACFFR_DAIF_Msk             /* DA Inverse filtering */ 
#define ETH_MACFFR_HM_Pos                      (2U)                            
#define ETH_MACFFR_HM_Msk                      (0x1U << ETH_MACFFR_HM_Pos)     /*!< 0x00000004 */
#define ETH_MACFFR_HM                          ETH_MACFFR_HM_Msk               /* Hash multicast */ 
#define ETH_MACFFR_HU_Pos                      (1U)                            
#define ETH_MACFFR_HU_Msk                      (0x1U << ETH_MACFFR_HU_Pos)     /*!< 0x00000002 */
#define ETH_MACFFR_HU                          ETH_MACFFR_HU_Msk               /* Hash unicast */
#define ETH_MACFFR_PM_Pos                      (0U)                            
#define ETH_MACFFR_PM_Msk                      (0x1U << ETH_MACFFR_PM_Pos)     /*!< 0x00000001 */
#define ETH_MACFFR_PM                          ETH_MACFFR_PM_Msk               /* Promiscuous mode */

/* Bit definition for Ethernet MAC Hash Table High Register */
#define ETH_MACHTHR_HTH_Pos                    (0U)                            
#define ETH_MACHTHR_HTH_Msk                    (0xFFFFFFFFU << ETH_MACHTHR_HTH_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACHTHR_HTH                        ETH_MACHTHR_HTH_Msk             /* Hash table high */

/* Bit definition for Ethernet MAC Hash Table Low Register */
#define ETH_MACHTLR_HTL_Pos                    (0U)                            
#define ETH_MACHTLR_HTL_Msk                    (0xFFFFFFFFU << ETH_MACHTLR_HTL_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACHTLR_HTL                        ETH_MACHTLR_HTL_Msk             /* Hash table low */

/* Bit definition for Ethernet MAC MII Address Register */
#define ETH_MACMIIAR_PA_Pos                    (11U)                           
#define ETH_MACMIIAR_PA_Msk                    (0x1FU << ETH_MACMIIAR_PA_Pos)  /*!< 0x0000F800 */
#define ETH_MACMIIAR_PA                        ETH_MACMIIAR_PA_Msk             /* Physical layer address */ 
#define ETH_MACMIIAR_MR_Pos                    (6U)                            
#define ETH_MACMIIAR_MR_Msk                    (0x1FU << ETH_MACMIIAR_MR_Pos)  /*!< 0x000007C0 */
#define ETH_MACMIIAR_MR                        ETH_MACMIIAR_MR_Msk             /* MII register in the selected PHY */ 
#define ETH_MACMIIAR_CR_Pos                    (2U)                            
#define ETH_MACMIIAR_CR_Msk                    (0x7U << ETH_MACMIIAR_CR_Pos)   /*!< 0x0000001C */
#define ETH_MACMIIAR_CR                        ETH_MACMIIAR_CR_Msk             /* CR clock range: 6 cases */ 
#define ETH_MACMIIAR_CR_DIV42                  0x00000000U                     /* HCLK:60-72 MHz; MDC clock= HCLK/42 */
#define ETH_MACMIIAR_CR_DIV16_Pos              (3U)                            
#define ETH_MACMIIAR_CR_DIV16_Msk              (0x1U << ETH_MACMIIAR_CR_DIV16_Pos) /*!< 0x00000008 */
#define ETH_MACMIIAR_CR_DIV16                  ETH_MACMIIAR_CR_DIV16_Msk       /* HCLK:20-35 MHz; MDC clock= HCLK/16 */
#define ETH_MACMIIAR_CR_DIV26_Pos              (2U)                            
#define ETH_MACMIIAR_CR_DIV26_Msk              (0x3U << ETH_MACMIIAR_CR_DIV26_Pos) /*!< 0x0000000C */
#define ETH_MACMIIAR_CR_DIV26                  ETH_MACMIIAR_CR_DIV26_Msk       /* HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ETH_MACMIIAR_MW_Pos                    (1U)                            
#define ETH_MACMIIAR_MW_Msk                    (0x1U << ETH_MACMIIAR_MW_Pos)   /*!< 0x00000002 */
#define ETH_MACMIIAR_MW                        ETH_MACMIIAR_MW_Msk             /* MII write */ 
#define ETH_MACMIIAR_MB_Pos                    (0U)                            
#define ETH_MACMIIAR_MB_Msk                    (0x1U << ETH_MACMIIAR_MB_Pos)   /*!< 0x00000001 */
#define ETH_MACMIIAR_MB                        ETH_MACMIIAR_MB_Msk             /* MII busy */ 
  
/* Bit definition for Ethernet MAC MII Data Register */
#define ETH_MACMIIDR_MD_Pos                    (0U)                            
#define ETH_MACMIIDR_MD_Msk                    (0xFFFFU << ETH_MACMIIDR_MD_Pos) /*!< 0x0000FFFF */
#define ETH_MACMIIDR_MD                        ETH_MACMIIDR_MD_Msk             /* MII data: read/write data from/to PHY */

/* Bit definition for Ethernet MAC Flow Control Register */
#define ETH_MACFCR_PT_Pos                      (16U)                           
#define ETH_MACFCR_PT_Msk                      (0xFFFFU << ETH_MACFCR_PT_Pos)  /*!< 0xFFFF0000 */
#define ETH_MACFCR_PT                          ETH_MACFCR_PT_Msk               /* Pause time */
#define ETH_MACFCR_ZQPD_Pos                    (7U)                            
#define ETH_MACFCR_ZQPD_Msk                    (0x1U << ETH_MACFCR_ZQPD_Pos)   /*!< 0x00000080 */
#define ETH_MACFCR_ZQPD                        ETH_MACFCR_ZQPD_Msk             /* Zero-quanta pause disable */
#define ETH_MACFCR_PLT_Pos                     (4U)                            
#define ETH_MACFCR_PLT_Msk                     (0x3U << ETH_MACFCR_PLT_Pos)    /*!< 0x00000030 */
#define ETH_MACFCR_PLT                         ETH_MACFCR_PLT_Msk              /* Pause low threshold: 4 cases */
#define ETH_MACFCR_PLT_Minus4                  0x00000000U                     /* Pause time minus 4 slot times */
#define ETH_MACFCR_PLT_Minus28_Pos             (4U)                            
#define ETH_MACFCR_PLT_Minus28_Msk             (0x1U << ETH_MACFCR_PLT_Minus28_Pos) /*!< 0x00000010 */
#define ETH_MACFCR_PLT_Minus28                 ETH_MACFCR_PLT_Minus28_Msk      /* Pause time minus 28 slot times */
#define ETH_MACFCR_PLT_Minus144_Pos            (5U)                            
#define ETH_MACFCR_PLT_Minus144_Msk            (0x1U << ETH_MACFCR_PLT_Minus144_Pos) /*!< 0x00000020 */
#define ETH_MACFCR_PLT_Minus144                ETH_MACFCR_PLT_Minus144_Msk     /* Pause time minus 144 slot times */
#define ETH_MACFCR_PLT_Minus256_Pos            (4U)                            
#define ETH_MACFCR_PLT_Minus256_Msk            (0x3U << ETH_MACFCR_PLT_Minus256_Pos) /*!< 0x00000030 */
#define ETH_MACFCR_PLT_Minus256                ETH_MACFCR_PLT_Minus256_Msk     /* Pause time minus 256 slot times */      
#define ETH_MACFCR_UPFD_Pos                    (3U)                            
#define ETH_MACFCR_UPFD_Msk                    (0x1U << ETH_MACFCR_UPFD_Pos)   /*!< 0x00000008 */
#define ETH_MACFCR_UPFD                        ETH_MACFCR_UPFD_Msk             /* Unicast pause frame detect */
#define ETH_MACFCR_RFCE_Pos                    (2U)                            
#define ETH_MACFCR_RFCE_Msk                    (0x1U << ETH_MACFCR_RFCE_Pos)   /*!< 0x00000004 */
#define ETH_MACFCR_RFCE                        ETH_MACFCR_RFCE_Msk             /* Receive flow control enable */
#define ETH_MACFCR_TFCE_Pos                    (1U)                            
#define ETH_MACFCR_TFCE_Msk                    (0x1U << ETH_MACFCR_TFCE_Pos)   /*!< 0x00000002 */
#define ETH_MACFCR_TFCE                        ETH_MACFCR_TFCE_Msk             /* Transmit flow control enable */
#define ETH_MACFCR_FCBBPA_Pos                  (0U)                            
#define ETH_MACFCR_FCBBPA_Msk                  (0x1U << ETH_MACFCR_FCBBPA_Pos) /*!< 0x00000001 */
#define ETH_MACFCR_FCBBPA                      ETH_MACFCR_FCBBPA_Msk           /* Flow control busy/backpressure activate */

/* Bit definition for Ethernet MAC VLAN Tag Register */
#define ETH_MACVLANTR_VLANTC_Pos               (16U)                           
#define ETH_MACVLANTR_VLANTC_Msk               (0x1U << ETH_MACVLANTR_VLANTC_Pos) /*!< 0x00010000 */
#define ETH_MACVLANTR_VLANTC                   ETH_MACVLANTR_VLANTC_Msk        /* 12-bit VLAN tag comparison */
#define ETH_MACVLANTR_VLANTI_Pos               (0U)                            
#define ETH_MACVLANTR_VLANTI_Msk               (0xFFFFU << ETH_MACVLANTR_VLANTI_Pos) /*!< 0x0000FFFF */
#define ETH_MACVLANTR_VLANTI                   ETH_MACVLANTR_VLANTI_Msk        /* VLAN tag identifier (for receive frames) */

/* Bit definition for Ethernet MAC Remote Wake-UpFrame Filter Register */ 
#define ETH_MACRWUFFR_D_Pos                    (0U)                            
#define ETH_MACRWUFFR_D_Msk                    (0xFFFFFFFFU << ETH_MACRWUFFR_D_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACRWUFFR_D                        ETH_MACRWUFFR_D_Msk             /* Wake-up frame filter register data */
/* Eight sequential Writes to this address (offset 0x28) will write all Wake-UpFrame Filter Registers.
   Eight sequential Reads from this address (offset 0x28) will read all Wake-UpFrame Filter Registers. */
/* Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
   Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
   Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
   Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
   Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command - 
                              RSVD - Filter1 Command - RSVD - Filter0 Command
   Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
   Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
   Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

/* Bit definition for Ethernet MAC PMT Control and Status Register */ 
#define ETH_MACPMTCSR_WFFRPR_Pos               (31U)                           
#define ETH_MACPMTCSR_WFFRPR_Msk               (0x1U << ETH_MACPMTCSR_WFFRPR_Pos) /*!< 0x80000000 */
#define ETH_MACPMTCSR_WFFRPR                   ETH_MACPMTCSR_WFFRPR_Msk        /* Wake-Up Frame Filter Register Pointer Reset */
#define ETH_MACPMTCSR_GU_Pos                   (9U)                            
#define ETH_MACPMTCSR_GU_Msk                   (0x1U << ETH_MACPMTCSR_GU_Pos)  /*!< 0x00000200 */
#define ETH_MACPMTCSR_GU                       ETH_MACPMTCSR_GU_Msk            /* Global Unicast */
#define ETH_MACPMTCSR_WFR_Pos                  (6U)                            
#define ETH_MACPMTCSR_WFR_Msk                  (0x1U << ETH_MACPMTCSR_WFR_Pos) /*!< 0x00000040 */
#define ETH_MACPMTCSR_WFR                      ETH_MACPMTCSR_WFR_Msk           /* Wake-Up Frame Received */
#define ETH_MACPMTCSR_MPR_Pos                  (5U)                            
#define ETH_MACPMTCSR_MPR_Msk                  (0x1U << ETH_MACPMTCSR_MPR_Pos) /*!< 0x00000020 */
#define ETH_MACPMTCSR_MPR                      ETH_MACPMTCSR_MPR_Msk           /* Magic Packet Received */
#define ETH_MACPMTCSR_WFE_Pos                  (2U)                            
#define ETH_MACPMTCSR_WFE_Msk                  (0x1U << ETH_MACPMTCSR_WFE_Pos) /*!< 0x00000004 */
#define ETH_MACPMTCSR_WFE                      ETH_MACPMTCSR_WFE_Msk           /* Wake-Up Frame Enable */
#define ETH_MACPMTCSR_MPE_Pos                  (1U)                            
#define ETH_MACPMTCSR_MPE_Msk                  (0x1U << ETH_MACPMTCSR_MPE_Pos) /*!< 0x00000002 */
#define ETH_MACPMTCSR_MPE                      ETH_MACPMTCSR_MPE_Msk           /* Magic Packet Enable */
#define ETH_MACPMTCSR_PD_Pos                   (0U)                            
#define ETH_MACPMTCSR_PD_Msk                   (0x1U << ETH_MACPMTCSR_PD_Pos)  /*!< 0x00000001 */
#define ETH_MACPMTCSR_PD                       ETH_MACPMTCSR_PD_Msk            /* Power Down */

/* Bit definition for Ethernet MAC Status Register */
#define ETH_MACSR_TSTS_Pos                     (9U)                            
#define ETH_MACSR_TSTS_Msk                     (0x1U << ETH_MACSR_TSTS_Pos)    /*!< 0x00000200 */
#define ETH_MACSR_TSTS                         ETH_MACSR_TSTS_Msk              /* Time stamp trigger status */
#define ETH_MACSR_MMCTS_Pos                    (6U)                            
#define ETH_MACSR_MMCTS_Msk                    (0x1U << ETH_MACSR_MMCTS_Pos)   /*!< 0x00000040 */
#define ETH_MACSR_MMCTS                        ETH_MACSR_MMCTS_Msk             /* MMC transmit status */
#define ETH_MACSR_MMMCRS_Pos                   (5U)                            
#define ETH_MACSR_MMMCRS_Msk                   (0x1U << ETH_MACSR_MMMCRS_Pos)  /*!< 0x00000020 */
#define ETH_MACSR_MMMCRS                       ETH_MACSR_MMMCRS_Msk            /* MMC receive status */
#define ETH_MACSR_MMCS_Pos                     (4U)                            
#define ETH_MACSR_MMCS_Msk                     (0x1U << ETH_MACSR_MMCS_Pos)    /*!< 0x00000010 */
#define ETH_MACSR_MMCS                         ETH_MACSR_MMCS_Msk              /* MMC status */
#define ETH_MACSR_PMTS_Pos                     (3U)                            
#define ETH_MACSR_PMTS_Msk                     (0x1U << ETH_MACSR_PMTS_Pos)    /*!< 0x00000008 */
#define ETH_MACSR_PMTS                         ETH_MACSR_PMTS_Msk              /* PMT status */

