ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F1xx/stm32f107xc.h
/* Bit definition for Ethernet MAC Interrupt Mask Register */
#define ETH_MACIMR_TSTIM_Pos                   (9U)                            
#define ETH_MACIMR_TSTIM_Msk                   (0x1U << ETH_MACIMR_TSTIM_Pos)  /*!< 0x00000200 */
#define ETH_MACIMR_TSTIM                       ETH_MACIMR_TSTIM_Msk            /* Time stamp trigger interrupt mask */
#define ETH_MACIMR_PMTIM_Pos                   (3U)                            
#define ETH_MACIMR_PMTIM_Msk                   (0x1U << ETH_MACIMR_PMTIM_Pos)  /*!< 0x00000008 */
#define ETH_MACIMR_PMTIM                       ETH_MACIMR_PMTIM_Msk            /* PMT interrupt mask */

/* Bit definition for Ethernet MAC Address0 High Register */
#define ETH_MACA0HR_MACA0H_Pos                 (0U)                            
#define ETH_MACA0HR_MACA0H_Msk                 (0xFFFFU << ETH_MACA0HR_MACA0H_Pos) /*!< 0x0000FFFF */
#define ETH_MACA0HR_MACA0H                     ETH_MACA0HR_MACA0H_Msk          /* MAC address0 high */

/* Bit definition for Ethernet MAC Address0 Low Register */
#define ETH_MACA0LR_MACA0L_Pos                 (0U)                            
#define ETH_MACA0LR_MACA0L_Msk                 (0xFFFFFFFFU << ETH_MACA0LR_MACA0L_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACA0LR_MACA0L                     ETH_MACA0LR_MACA0L_Msk          /* MAC address0 low */

/* Bit definition for Ethernet MAC Address1 High Register */
#define ETH_MACA1HR_AE_Pos                     (31U)                           
#define ETH_MACA1HR_AE_Msk                     (0x1U << ETH_MACA1HR_AE_Pos)    /*!< 0x80000000 */
#define ETH_MACA1HR_AE                         ETH_MACA1HR_AE_Msk              /* Address enable */
#define ETH_MACA1HR_SA_Pos                     (30U)                           
#define ETH_MACA1HR_SA_Msk                     (0x1U << ETH_MACA1HR_SA_Pos)    /*!< 0x40000000 */
#define ETH_MACA1HR_SA                         ETH_MACA1HR_SA_Msk              /* Source address */
#define ETH_MACA1HR_MBC_Pos                    (24U)                           
#define ETH_MACA1HR_MBC_Msk                    (0x3FU << ETH_MACA1HR_MBC_Pos)  /*!< 0x3F000000 */
#define ETH_MACA1HR_MBC                        ETH_MACA1HR_MBC_Msk             /* Mask byte control: bits to mask for comparison of the MAC Address bytes */
#define ETH_MACA1HR_MBC_HBits15_8              0x20000000U                     /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACA1HR_MBC_HBits7_0               0x10000000U                     /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACA1HR_MBC_LBits31_24             0x08000000U                     /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACA1HR_MBC_LBits23_16             0x04000000U                     /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACA1HR_MBC_LBits15_8              0x02000000U                     /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACA1HR_MBC_LBits7_0               0x01000000U                     /* Mask MAC Address low reg bits [7:0] */ 
#define ETH_MACA1HR_MACA1H_Pos                 (0U)                            
#define ETH_MACA1HR_MACA1H_Msk                 (0xFFFFU << ETH_MACA1HR_MACA1H_Pos) /*!< 0x0000FFFF */
#define ETH_MACA1HR_MACA1H                     ETH_MACA1HR_MACA1H_Msk          /* MAC address1 high */

/* Bit definition for Ethernet MAC Address1 Low Register */
#define ETH_MACA1LR_MACA1L_Pos                 (0U)                            
#define ETH_MACA1LR_MACA1L_Msk                 (0xFFFFFFFFU << ETH_MACA1LR_MACA1L_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACA1LR_MACA1L                     ETH_MACA1LR_MACA1L_Msk          /* MAC address1 low */

/* Bit definition for Ethernet MAC Address2 High Register */
#define ETH_MACA2HR_AE_Pos                     (31U)                           
#define ETH_MACA2HR_AE_Msk                     (0x1U << ETH_MACA2HR_AE_Pos)    /*!< 0x80000000 */
#define ETH_MACA2HR_AE                         ETH_MACA2HR_AE_Msk              /* Address enable */
#define ETH_MACA2HR_SA_Pos                     (30U)                           
#define ETH_MACA2HR_SA_Msk                     (0x1U << ETH_MACA2HR_SA_Pos)    /*!< 0x40000000 */
#define ETH_MACA2HR_SA                         ETH_MACA2HR_SA_Msk              /* Source address */
#define ETH_MACA2HR_MBC_Pos                    (24U)                           
#define ETH_MACA2HR_MBC_Msk                    (0x3FU << ETH_MACA2HR_MBC_Pos)  /*!< 0x3F000000 */
#define ETH_MACA2HR_MBC                        ETH_MACA2HR_MBC_Msk             /* Mask byte control */
#define ETH_MACA2HR_MBC_HBits15_8              0x20000000U                     /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACA2HR_MBC_HBits7_0               0x10000000U                     /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACA2HR_MBC_LBits31_24             0x08000000U                     /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACA2HR_MBC_LBits23_16             0x04000000U                     /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACA2HR_MBC_LBits15_8              0x02000000U                     /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACA2HR_MBC_LBits7_0               0x01000000U                     /* Mask MAC Address low reg bits [70] */
#define ETH_MACA2HR_MACA2H_Pos                 (0U)                            
#define ETH_MACA2HR_MACA2H_Msk                 (0xFFFFU << ETH_MACA2HR_MACA2H_Pos) /*!< 0x0000FFFF */
#define ETH_MACA2HR_MACA2H                     ETH_MACA2HR_MACA2H_Msk          /* MAC address1 high */

/* Bit definition for Ethernet MAC Address2 Low Register */
#define ETH_MACA2LR_MACA2L_Pos                 (0U)                            
#define ETH_MACA2LR_MACA2L_Msk                 (0xFFFFFFFFU << ETH_MACA2LR_MACA2L_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACA2LR_MACA2L                     ETH_MACA2LR_MACA2L_Msk          /* MAC address2 low */

/* Bit definition for Ethernet MAC Address3 High Register */
#define ETH_MACA3HR_AE_Pos                     (31U)                           
#define ETH_MACA3HR_AE_Msk                     (0x1U << ETH_MACA3HR_AE_Pos)    /*!< 0x80000000 */
#define ETH_MACA3HR_AE                         ETH_MACA3HR_AE_Msk              /* Address enable */
#define ETH_MACA3HR_SA_Pos                     (30U)                           
#define ETH_MACA3HR_SA_Msk                     (0x1U << ETH_MACA3HR_SA_Pos)    /*!< 0x40000000 */
#define ETH_MACA3HR_SA                         ETH_MACA3HR_SA_Msk              /* Source address */
#define ETH_MACA3HR_MBC_Pos                    (24U)                           
#define ETH_MACA3HR_MBC_Msk                    (0x3FU << ETH_MACA3HR_MBC_Pos)  /*!< 0x3F000000 */
#define ETH_MACA3HR_MBC                        ETH_MACA3HR_MBC_Msk             /* Mask byte control */
#define ETH_MACA3HR_MBC_HBits15_8              0x20000000U                     /* Mask MAC Address high reg bits [15:8] */
#define ETH_MACA3HR_MBC_HBits7_0               0x10000000U                     /* Mask MAC Address high reg bits [7:0] */
#define ETH_MACA3HR_MBC_LBits31_24             0x08000000U                     /* Mask MAC Address low reg bits [31:24] */
#define ETH_MACA3HR_MBC_LBits23_16             0x04000000U                     /* Mask MAC Address low reg bits [23:16] */
#define ETH_MACA3HR_MBC_LBits15_8              0x02000000U                     /* Mask MAC Address low reg bits [15:8] */
#define ETH_MACA3HR_MBC_LBits7_0               0x01000000U                     /* Mask MAC Address low reg bits [70] */
#define ETH_MACA3HR_MACA3H_Pos                 (0U)                            
#define ETH_MACA3HR_MACA3H_Msk                 (0xFFFFU << ETH_MACA3HR_MACA3H_Pos) /*!< 0x0000FFFF */
#define ETH_MACA3HR_MACA3H                     ETH_MACA3HR_MACA3H_Msk          /* MAC address3 high */

/* Bit definition for Ethernet MAC Address3 Low Register */
#define ETH_MACA3LR_MACA3L_Pos                 (0U)                            
#define ETH_MACA3LR_MACA3L_Msk                 (0xFFFFFFFFU << ETH_MACA3LR_MACA3L_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACA3LR_MACA3L                     ETH_MACA3LR_MACA3L_Msk          /* MAC address3 low */

/******************************************************************************/
/*                Ethernet MMC Registers bits definition                      */
/******************************************************************************/

/* Bit definition for Ethernet MMC Contol Register */
#define ETH_MMCCR_MCF_Pos                      (3U)                            
#define ETH_MMCCR_MCF_Msk                      (0x1U << ETH_MMCCR_MCF_Pos)     /*!< 0x00000008 */
#define ETH_MMCCR_MCF                          ETH_MMCCR_MCF_Msk               /* MMC Counter Freeze */
#define ETH_MMCCR_ROR_Pos                      (2U)                            
#define ETH_MMCCR_ROR_Msk                      (0x1U << ETH_MMCCR_ROR_Pos)     /*!< 0x00000004 */
#define ETH_MMCCR_ROR                          ETH_MMCCR_ROR_Msk               /* Reset on Read */
#define ETH_MMCCR_CSR_Pos                      (1U)                            
#define ETH_MMCCR_CSR_Msk                      (0x1U << ETH_MMCCR_CSR_Pos)     /*!< 0x00000002 */
#define ETH_MMCCR_CSR                          ETH_MMCCR_CSR_Msk               /* Counter Stop Rollover */
#define ETH_MMCCR_CR_Pos                       (0U)                            
#define ETH_MMCCR_CR_Msk                       (0x1U << ETH_MMCCR_CR_Pos)      /*!< 0x00000001 */
#define ETH_MMCCR_CR                           ETH_MMCCR_CR_Msk                /* Counters Reset */

/* Bit definition for Ethernet MMC Receive Interrupt Register */
#define ETH_MMCRIR_RGUFS_Pos                   (17U)                           
#define ETH_MMCRIR_RGUFS_Msk                   (0x1U << ETH_MMCRIR_RGUFS_Pos)  /*!< 0x00020000 */
#define ETH_MMCRIR_RGUFS                       ETH_MMCRIR_RGUFS_Msk            /* Set when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRIR_RFAES_Pos                   (6U)                            
#define ETH_MMCRIR_RFAES_Msk                   (0x1U << ETH_MMCRIR_RFAES_Pos)  /*!< 0x00000040 */
#define ETH_MMCRIR_RFAES                       ETH_MMCRIR_RFAES_Msk            /* Set when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRIR_RFCES_Pos                   (5U)                            
#define ETH_MMCRIR_RFCES_Msk                   (0x1U << ETH_MMCRIR_RFCES_Pos)  /*!< 0x00000020 */
#define ETH_MMCRIR_RFCES                       ETH_MMCRIR_RFCES_Msk            /* Set when Rx crc error counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Register */
#define ETH_MMCTIR_TGFS_Pos                    (21U)                           
#define ETH_MMCTIR_TGFS_Msk                    (0x1U << ETH_MMCTIR_TGFS_Pos)   /*!< 0x00200000 */
#define ETH_MMCTIR_TGFS                        ETH_MMCTIR_TGFS_Msk             /* Set when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTIR_TGFMSCS_Pos                 (15U)                           
#define ETH_MMCTIR_TGFMSCS_Msk                 (0x1U << ETH_MMCTIR_TGFMSCS_Pos) /*!< 0x00008000 */
#define ETH_MMCTIR_TGFMSCS                     ETH_MMCTIR_TGFMSCS_Msk          /* Set when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTIR_TGFSCS_Pos                  (14U)                           
#define ETH_MMCTIR_TGFSCS_Msk                  (0x1U << ETH_MMCTIR_TGFSCS_Pos) /*!< 0x00004000 */
#define ETH_MMCTIR_TGFSCS                      ETH_MMCTIR_TGFSCS_Msk           /* Set when Tx good single col counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Receive Interrupt Mask Register */
#define ETH_MMCRIMR_RGUFM_Pos                  (17U)                           
#define ETH_MMCRIMR_RGUFM_Msk                  (0x1U << ETH_MMCRIMR_RGUFM_Pos) /*!< 0x00020000 */
#define ETH_MMCRIMR_RGUFM                      ETH_MMCRIMR_RGUFM_Msk           /* Mask the interrupt when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRIMR_RFAEM_Pos                  (6U)                            
#define ETH_MMCRIMR_RFAEM_Msk                  (0x1U << ETH_MMCRIMR_RFAEM_Pos) /*!< 0x00000040 */
#define ETH_MMCRIMR_RFAEM                      ETH_MMCRIMR_RFAEM_Msk           /* Mask the interrupt when when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRIMR_RFCEM_Pos                  (5U)                            
#define ETH_MMCRIMR_RFCEM_Msk                  (0x1U << ETH_MMCRIMR_RFCEM_Pos) /*!< 0x00000020 */
#define ETH_MMCRIMR_RFCEM                      ETH_MMCRIMR_RFCEM_Msk           /* Mask the interrupt when Rx crc error counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmit Interrupt Mask Register */
#define ETH_MMCTIMR_TGFM_Pos                   (21U)                           
#define ETH_MMCTIMR_TGFM_Msk                   (0x1U << ETH_MMCTIMR_TGFM_Pos)  /*!< 0x00200000 */
#define ETH_MMCTIMR_TGFM                       ETH_MMCTIMR_TGFM_Msk            /* Mask the interrupt when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTIMR_TGFMSCM_Pos                (15U)                           
#define ETH_MMCTIMR_TGFMSCM_Msk                (0x1U << ETH_MMCTIMR_TGFMSCM_Pos) /*!< 0x00008000 */
#define ETH_MMCTIMR_TGFMSCM                    ETH_MMCTIMR_TGFMSCM_Msk         /* Mask the interrupt when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTIMR_TGFSCM_Pos                 (14U)                           
#define ETH_MMCTIMR_TGFSCM_Msk                 (0x1U << ETH_MMCTIMR_TGFSCM_Pos) /*!< 0x00004000 */
#define ETH_MMCTIMR_TGFSCM                     ETH_MMCTIMR_TGFSCM_Msk          /* Mask the interrupt when Tx good single col counter reaches half the maximum value */

/* Bit definition for Ethernet MMC Transmitted Good Frames after Single Collision Counter Register */
#define ETH_MMCTGFSCCR_TGFSCC_Pos              (0U)                            
#define ETH_MMCTGFSCCR_TGFSCC_Msk              (0xFFFFFFFFU << ETH_MMCTGFSCCR_TGFSCC_Pos) /*!< 0xFFFFFFFF */
#define ETH_MMCTGFSCCR_TGFSCC                  ETH_MMCTGFSCCR_TGFSCC_Msk       /* Number of successfully transmitted frames after a single collision in Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register */
#define ETH_MMCTGFMSCCR_TGFMSCC_Pos            (0U)                            
#define ETH_MMCTGFMSCCR_TGFMSCC_Msk            (0xFFFFFFFFU << ETH_MMCTGFMSCCR_TGFMSCC_Pos) /*!< 0xFFFFFFFF */
#define ETH_MMCTGFMSCCR_TGFMSCC                ETH_MMCTGFMSCCR_TGFMSCC_Msk     /* Number of successfully transmitted frames after more than a single collision in Half-duplex mode. */

/* Bit definition for Ethernet MMC Transmitted Good Frames Counter Register */
#define ETH_MMCTGFCR_TGFC_Pos                  (0U)                            
#define ETH_MMCTGFCR_TGFC_Msk                  (0xFFFFFFFFU << ETH_MMCTGFCR_TGFC_Pos) /*!< 0xFFFFFFFF */
#define ETH_MMCTGFCR_TGFC                      ETH_MMCTGFCR_TGFC_Msk           /* Number of good frames transmitted. */

